{
  "caseStudies": [
    {
      "id": "indigo-sun-florals",
      "title": "Indigo Sun Florals E-Commerce Platform",
      "client": "Indigo Sun Florals",
      "date": "2025-10-05",
      "category": "E-Commerce Development",
      "technologies": [
        "React 19",
        "TanStack Start",
        "PostgreSQL",
        "Drizzle ORM",
        "Tailwind CSS",
        "Better Auth"
      ],
      "featured": true,
      "thumbnail": "/assets/images/indigo-sun-florals-thumb.jpg",
      "liveDemo": "https://dev1.appahouse.com/products",
      "repository": "",
      "developmentTime": "2 weeks",
      "linesOfCode": "8,341",
      "excerpt": "A modern e-commerce platform for locally sourced flower arrangements with inventory management and subscription capabilities.",
      "challenge": "Indigo Sun Florals needed a way to sell locally sourced flower arrangements that vary by season and availability. The challenge was to create a system that could handle dynamic inventory, custom arrangements, and provide a subscription model to increase customer retention and predictable cash flow.",
      "solution": "Built a full-featured e-commerce website with real-time inventory display, custom arrangement builder, and subscription management system. The platform allows customers to browse available stock, create custom arrangements, and subscribe for recurring deliveries based on seasonal availability.",
      "developmentProcess": "The project followed an agile development approach with weekly sprints. Started with database schema design and authentication, then built the product catalog system, followed by the shopping cart and checkout flow. Final phase included the subscription system and admin dashboard for inventory management.",
      "technicalImplementation": "Utilized React 19 with the new React Compiler for optimal performance. TanStack Start provided the full-stack framework with server-side rendering and API routes. Drizzle ORM with PostgreSQL handled complex inventory queries and transaction management. Better Auth provided secure authentication with role-based access control for customers and administrators.",
      "results": "The platform achieved a 40% increase in customer retention through the subscription model, 65% improvement in click-through rates compared to the previous solution, and streamlined the payment process resulting in 30% faster checkout times. Inventory management became 50% more efficient with real-time updates.",
      "lessonsLearned": "Taking time to properly design the database schema upfront saved significant refactoring time later. The subscription model proved to be more valuable than anticipated, driving consistent revenue. Real-time inventory updates were crucial for managing seasonal products and preventing overselling.",
      "images": [
        "/assets/images/indigo-sun-florals-1.jpg",
        "/assets/images/indigo-sun-florals-2.jpg",
        "/assets/images/indigo-sun-florals-3.jpg"
      ]
    }
  ],
  "categories": [
    "E-Commerce Development",
    "Web Application",
    "Full-Stack Development"
  ],
  "technologies": [
    "React 19",
    "TanStack Start",
    "PostgreSQL",
    "Drizzle ORM",
    "Tailwind CSS",
    "Better Auth",
    "TypeScript",
    "Docker"
  ]
}